{
  "nbformat": 4,
  "nbformat_minor": 0,
  "metadata": {
    "colab": {
      "provenance": []
    },
    "kernelspec": {
      "name": "python3",
      "display_name": "Python 3"
    },
    "language_info": {
      "name": "python"
    }
  },
  "cells": [
    {
      "cell_type": "markdown",
      "source": [
        "# Author: Omkar Bare\n",
        "\n",
        "## Project: Knowlegde Graph Based Retrieval-Augmented Generation (RAG) System For U.S. Securities and Exchange Commission (SEC) filings data (Company: NetApp, Inc.)\n",
        "\n",
        "NetApp, Inc. is an American data infrastructure company that provides unified data storage, integrated data services, and cloud operations (CloudOps) solutions to enterprise customers. https://en.wikipedia.org/wiki/NetApp\n",
        "\n",
        "This notebook implements:\n",
        "- building relationship between nodes created for form 10k.\n",
        "- construction of nodes for form 13.\n",
        "- creating relationship between nodes of form 10k and form13.\n",
        "\n",
        "Construction of relationship between nodes for form 10k is done in this notebook: https://colab.research.google.com/drive/1UnQEfa66TtXmlHAM-IfC-R0ZahIcFEl5?usp=sharing\n"
      ],
      "metadata": {
        "id": "Wp38qtTQ4xLf"
      }
    },
    {
      "cell_type": "markdown",
      "source": [
        "Data used in this project:\n",
        " - SEC Form 10k for company NetApp Inc. (retrieved and stored in `.json` format from SEC website): Publicly traded companies are required to fill a form 10-K each year with the Securities and Exchange Commision (SEC)\n",
        "\n",
        "\n",
        " - SEC Form 13 for the company NetApp Inc. (retrieved and stored in `.csv` format from SEC website): Investment management firms must report on their investments in companies to the SEC by filing a document called **Form 13**"
      ],
      "metadata": {
        "id": "UTzqH1T5AOeE"
      }
    },
    {
      "cell_type": "code",
      "execution_count": 1,
      "metadata": {
        "id": "fAxRKtjVMN1H"
      },
      "outputs": [],
      "source": [
        "!pip install neo4j langchain==0.3.18 langchain_community==0.3.17 langchain_openai==0.3.6 openai>=1.6.1 langchain_text_splitters==0.3.6\n"
      ]
    },
    {
      "cell_type": "code",
      "source": [
        "import json\n",
        "import textwrap\n",
        "\n",
        "from google.colab import userdata\n",
        "\n",
        "# Langchain\n",
        "from langchain_community.graphs import Neo4jGraph\n",
        "from langchain_community.vectorstores import Neo4jVector\n",
        "from langchain_openai import OpenAIEmbeddings\n",
        "from langchain.text_splitter import RecursiveCharacterTextSplitter\n",
        "from langchain.chains import RetrievalQAWithSourcesChain\n",
        "from langchain_openai import ChatOpenAI\n",
        "\n",
        "# Warning control\n",
        "import warnings\n",
        "warnings.filterwarnings(\"ignore\")"
      ],
      "metadata": {
        "id": "wBNhHinQNWzT"
      },
      "execution_count": 2,
      "outputs": []
    },
    {
      "cell_type": "code",
      "source": [
        "NEO4J_URI = userdata.get('NEO4J_URI')\n",
        "NEO4J_USERNAME = userdata.get('NEO4J_USERNAME')\n",
        "NEO4J_PASSWORD = userdata.get('NEO4J_PASSWORD')\n",
        "NEO4J_DATABASE = userdata.get('NEO4J_DATABASE')\n",
        "\n",
        "OPENAI_API_KEY = userdata.get('OPENAI_API_KEY')\n",
        "OPENAI_ENDPOINT = userdata.get('OPENAI_BASE_URL') + '/embeddings'"
      ],
      "metadata": {
        "id": "sxvtAOXHNZKk"
      },
      "execution_count": 3,
      "outputs": []
    },
    {
      "cell_type": "code",
      "source": [
        "# Global constants\n",
        "VECTOR_INDEX_NAME = 'form_10k_chunks'\n",
        "VECTOR_NODE_LABEL = 'Chunk'\n",
        "VECTOR_SOURCE_PROPERTY = 'text'\n",
        "VECTOR_EMBEDDING_PROPERTY = 'textEmbedding'"
      ],
      "metadata": {
        "id": "vXtr7GFfOzYZ"
      },
      "execution_count": 4,
      "outputs": []
    },
    {
      "cell_type": "code",
      "source": [
        "kg = Neo4jGraph(\n",
        "    url=NEO4J_URI,\n",
        "    username=NEO4J_USERNAME,\n",
        "    password=NEO4J_PASSWORD,\n",
        "    database=NEO4J_DATABASE\n",
        ")"
      ],
      "metadata": {
        "id": "eaOdGS77Oz-P"
      },
      "execution_count": 5,
      "outputs": []
    },
    {
      "cell_type": "markdown",
      "source": [
        "# Creating relationships between nodes for Form 10k"
      ],
      "metadata": {
        "id": "yItXKigQPL-n"
      }
    },
    {
      "cell_type": "markdown",
      "source": [
        "### Create a Form 10-K node\n",
        "- Create a node to represent the entire Form 10-K"
      ],
      "metadata": {
        "id": "GyvOKfFKPK2p"
      }
    },
    {
      "cell_type": "code",
      "source": [
        "cypher = \"\"\"\n",
        "  MATCH (anyChunk:Chunk)\n",
        "  WITH anyChunk LIMIT 1\n",
        "  RETURN anyChunk { .names, .source, .formId, .cik, .cusip6 } as formInfo\n",
        "\"\"\"\n",
        "form_info_list = kg.query(cypher)\n",
        "\n",
        "form_info_list"
      ],
      "metadata": {
        "colab": {
          "base_uri": "https://localhost:8080/"
        },
        "id": "zD6woc2cO2H0",
        "outputId": "ad98b682-eb6c-417d-f757-abb0df7b578a"
      },
      "execution_count": 10,
      "outputs": [
        {
          "output_type": "execute_result",
          "data": {
            "text/plain": [
              "[{'formInfo': {'cusip6': '64110D',\n",
              "   'formId': '0000950170-23-027948',\n",
              "   'names': ['Netapp Inc', 'NETAPP INC'],\n",
              "   'source': 'https://www.sec.gov/Archives/edgar/data/1002047/000095017023027948/0000950170-23-027948-index.htm',\n",
              "   'cik': '1002047'}}]"
            ]
          },
          "metadata": {},
          "execution_count": 10
        }
      ]
    },
    {
      "cell_type": "code",
      "source": [
        "form_info = form_info_list[0]['formInfo']\n",
        "form_info"
      ],
      "metadata": {
        "id": "UW_JB6w0SC4y"
      },
      "execution_count": null,
      "outputs": []
    },
    {
      "cell_type": "markdown",
      "source": [
        "- Populate with metadata taken from a single chunk of the form"
      ],
      "metadata": {
        "id": "_T9JhqYxP6uu"
      }
    },
    {
      "cell_type": "code",
      "source": [
        "cypher = \"\"\"\n",
        "    MERGE (f:Form {formId: $formInfoParam.formId })\n",
        "      ON CREATE\n",
        "        SET f.names = $formInfoParam.names\n",
        "        SET f.source = $formInfoParam.source\n",
        "        SET f.cik = $formInfoParam.cik\n",
        "        SET f.cusip6 = $formInfoParam.cusip6\n",
        "\"\"\"\n",
        "\n",
        "kg.query(cypher, params={'formInfoParam': form_info})"
      ],
      "metadata": {
        "colab": {
          "base_uri": "https://localhost:8080/"
        },
        "id": "j9NzMmy7PdmX",
        "outputId": "618a411b-0a31-4568-ffe2-170fd4b603ed"
      },
      "execution_count": 13,
      "outputs": [
        {
          "output_type": "execute_result",
          "data": {
            "text/plain": [
              "[]"
            ]
          },
          "metadata": {},
          "execution_count": 13
        }
      ]
    },
    {
      "cell_type": "code",
      "source": [
        "kg.query(\"MATCH (f:Form) RETURN count(f) as formCount\")"
      ],
      "metadata": {
        "colab": {
          "base_uri": "https://localhost:8080/"
        },
        "id": "E1qwTEejQGO8",
        "outputId": "ae1a3119-dff3-4f01-fa1b-ea00f0404063"
      },
      "execution_count": 14,
      "outputs": [
        {
          "output_type": "execute_result",
          "data": {
            "text/plain": [
              "[{'formCount': 1}]"
            ]
          },
          "metadata": {},
          "execution_count": 14
        }
      ]
    },
    {
      "cell_type": "markdown",
      "source": [
        "### Create a linked list of Chunk nodes for each section\n",
        "- Start by identifying chunks from the same section"
      ],
      "metadata": {
        "id": "Y_0uu3wASJZ9"
      }
    },
    {
      "cell_type": "code",
      "source": [
        "cypher = \"\"\"\n",
        "  MATCH (from_same_form:Chunk)\n",
        "    WHERE from_same_form.formId = $formIdParam\n",
        "  RETURN from_same_form {.formId, .f10kItem, .chunkId, .chunkSeqId } as chunkInfo\n",
        "    LIMIT 10\n",
        "\"\"\"\n",
        "\n",
        "kg.query(cypher, params={'formIdParam': form_info['formId']})"
      ],
      "metadata": {
        "colab": {
          "base_uri": "https://localhost:8080/"
        },
        "id": "FVkOBwMZQIcB",
        "outputId": "61a3c569-a5a1-4b5d-f487-252f33a40434"
      },
      "execution_count": 15,
      "outputs": [
        {
          "output_type": "execute_result",
          "data": {
            "text/plain": [
              "[{'chunkInfo': {'formId': '0000950170-23-027948',\n",
              "   'f10kItem': 'item1',\n",
              "   'chunkId': '0000950170-23-027948-item1-chunk0000',\n",
              "   'chunkSeqId': 0}},\n",
              " {'chunkInfo': {'formId': '0000950170-23-027948',\n",
              "   'f10kItem': 'item1',\n",
              "   'chunkId': '0000950170-23-027948-item1-chunk0001',\n",
              "   'chunkSeqId': 1}},\n",
              " {'chunkInfo': {'formId': '0000950170-23-027948',\n",
              "   'f10kItem': 'item1',\n",
              "   'chunkId': '0000950170-23-027948-item1-chunk0002',\n",
              "   'chunkSeqId': 2}},\n",
              " {'chunkInfo': {'formId': '0000950170-23-027948',\n",
              "   'f10kItem': 'item1',\n",
              "   'chunkId': '0000950170-23-027948-item1-chunk0003',\n",
              "   'chunkSeqId': 3}},\n",
              " {'chunkInfo': {'formId': '0000950170-23-027948',\n",
              "   'f10kItem': 'item1',\n",
              "   'chunkId': '0000950170-23-027948-item1-chunk0004',\n",
              "   'chunkSeqId': 4}},\n",
              " {'chunkInfo': {'formId': '0000950170-23-027948',\n",
              "   'f10kItem': 'item1',\n",
              "   'chunkId': '0000950170-23-027948-item1-chunk0005',\n",
              "   'chunkSeqId': 5}},\n",
              " {'chunkInfo': {'formId': '0000950170-23-027948',\n",
              "   'f10kItem': 'item1',\n",
              "   'chunkId': '0000950170-23-027948-item1-chunk0006',\n",
              "   'chunkSeqId': 6}},\n",
              " {'chunkInfo': {'formId': '0000950170-23-027948',\n",
              "   'f10kItem': 'item1',\n",
              "   'chunkId': '0000950170-23-027948-item1-chunk0007',\n",
              "   'chunkSeqId': 7}},\n",
              " {'chunkInfo': {'formId': '0000950170-23-027948',\n",
              "   'f10kItem': 'item1',\n",
              "   'chunkId': '0000950170-23-027948-item1-chunk0008',\n",
              "   'chunkSeqId': 8}},\n",
              " {'chunkInfo': {'formId': '0000950170-23-027948',\n",
              "   'f10kItem': 'item1',\n",
              "   'chunkId': '0000950170-23-027948-item1-chunk0009',\n",
              "   'chunkSeqId': 9}}]"
            ]
          },
          "metadata": {},
          "execution_count": 15
        }
      ]
    },
    {
      "cell_type": "markdown",
      "source": [
        "- Order chunks by their sequence ID"
      ],
      "metadata": {
        "id": "ZshcsTciSdZL"
      }
    },
    {
      "cell_type": "code",
      "source": [
        "cypher = \"\"\"\n",
        "  MATCH (from_same_form:Chunk)\n",
        "    WHERE from_same_form.formId = $formIdParam\n",
        "  RETURN from_same_form {.formId, .f10kItem, .chunkId, .chunkSeqId } as chunkInfo\n",
        "    ORDER BY from_same_form.chunkSeqId ASC\n",
        "    LIMIT 10\n",
        "\"\"\"\n",
        "\n",
        "kg.query(cypher, params={'formIdParam': form_info['formId']})"
      ],
      "metadata": {
        "colab": {
          "base_uri": "https://localhost:8080/"
        },
        "id": "hbEwSU48Sfnd",
        "outputId": "29cf5693-c721-4055-d665-bde8ef73cd3b"
      },
      "execution_count": 16,
      "outputs": [
        {
          "output_type": "execute_result",
          "data": {
            "text/plain": [
              "[{'chunkInfo': {'formId': '0000950170-23-027948',\n",
              "   'f10kItem': 'item7a',\n",
              "   'chunkId': '0000950170-23-027948-item7a-chunk0000',\n",
              "   'chunkSeqId': 0}},\n",
              " {'chunkInfo': {'formId': '0000950170-23-027948',\n",
              "   'f10kItem': 'item7',\n",
              "   'chunkId': '0000950170-23-027948-item7-chunk0000',\n",
              "   'chunkSeqId': 0}},\n",
              " {'chunkInfo': {'formId': '0000950170-23-027948',\n",
              "   'f10kItem': 'item1a',\n",
              "   'chunkId': '0000950170-23-027948-item1a-chunk0000',\n",
              "   'chunkSeqId': 0}},\n",
              " {'chunkInfo': {'formId': '0000950170-23-027948',\n",
              "   'f10kItem': 'item1',\n",
              "   'chunkId': '0000950170-23-027948-item1-chunk0000',\n",
              "   'chunkSeqId': 0}},\n",
              " {'chunkInfo': {'formId': '0000950170-23-027948',\n",
              "   'f10kItem': 'item1',\n",
              "   'chunkId': '0000950170-23-027948-item1-chunk0001',\n",
              "   'chunkSeqId': 1}},\n",
              " {'chunkInfo': {'formId': '0000950170-23-027948',\n",
              "   'f10kItem': 'item1',\n",
              "   'chunkId': '0000950170-23-027948-item1-chunk0002',\n",
              "   'chunkSeqId': 2}},\n",
              " {'chunkInfo': {'formId': '0000950170-23-027948',\n",
              "   'f10kItem': 'item1',\n",
              "   'chunkId': '0000950170-23-027948-item1-chunk0003',\n",
              "   'chunkSeqId': 3}},\n",
              " {'chunkInfo': {'formId': '0000950170-23-027948',\n",
              "   'f10kItem': 'item1',\n",
              "   'chunkId': '0000950170-23-027948-item1-chunk0004',\n",
              "   'chunkSeqId': 4}},\n",
              " {'chunkInfo': {'formId': '0000950170-23-027948',\n",
              "   'f10kItem': 'item1',\n",
              "   'chunkId': '0000950170-23-027948-item1-chunk0005',\n",
              "   'chunkSeqId': 5}},\n",
              " {'chunkInfo': {'formId': '0000950170-23-027948',\n",
              "   'f10kItem': 'item1',\n",
              "   'chunkId': '0000950170-23-027948-item1-chunk0006',\n",
              "   'chunkSeqId': 6}}]"
            ]
          },
          "metadata": {},
          "execution_count": 16
        }
      ]
    },
    {
      "cell_type": "markdown",
      "source": [
        "- Limit chunks to just the \"Item 1\" section, organizedd in ascending order"
      ],
      "metadata": {
        "id": "4yaeLsVhUKq4"
      }
    },
    {
      "cell_type": "code",
      "source": [
        "cypher = \"\"\"\n",
        "  MATCH (from_same_section:Chunk)\n",
        "  WHERE from_same_section.formId = $formIdParam\n",
        "    AND from_same_section.f10kItem = $f10kItemParam\n",
        "  RETURN from_same_section { .formId, .f10kItem, .chunkId, .chunkSeqId }\n",
        "    ORDER BY from_same_section.chunkSeqId ASC\n",
        "    LIMIT 10\n",
        "\"\"\"\n",
        "\n",
        "kg.query(cypher, params={'formIdParam': form_info['formId'],\n",
        "                         'f10kItemParam': 'item1'})"
      ],
      "metadata": {
        "colab": {
          "base_uri": "https://localhost:8080/"
        },
        "id": "8UzS4EoZSjU8",
        "outputId": "c916ccca-a436-4114-dc2c-421f1afa2d43"
      },
      "execution_count": 17,
      "outputs": [
        {
          "output_type": "execute_result",
          "data": {
            "text/plain": [
              "[{'from_same_section': {'formId': '0000950170-23-027948',\n",
              "   'f10kItem': 'item1',\n",
              "   'chunkId': '0000950170-23-027948-item1-chunk0000',\n",
              "   'chunkSeqId': 0}},\n",
              " {'from_same_section': {'formId': '0000950170-23-027948',\n",
              "   'f10kItem': 'item1',\n",
              "   'chunkId': '0000950170-23-027948-item1-chunk0001',\n",
              "   'chunkSeqId': 1}},\n",
              " {'from_same_section': {'formId': '0000950170-23-027948',\n",
              "   'f10kItem': 'item1',\n",
              "   'chunkId': '0000950170-23-027948-item1-chunk0002',\n",
              "   'chunkSeqId': 2}},\n",
              " {'from_same_section': {'formId': '0000950170-23-027948',\n",
              "   'f10kItem': 'item1',\n",
              "   'chunkId': '0000950170-23-027948-item1-chunk0003',\n",
              "   'chunkSeqId': 3}},\n",
              " {'from_same_section': {'formId': '0000950170-23-027948',\n",
              "   'f10kItem': 'item1',\n",
              "   'chunkId': '0000950170-23-027948-item1-chunk0004',\n",
              "   'chunkSeqId': 4}},\n",
              " {'from_same_section': {'formId': '0000950170-23-027948',\n",
              "   'f10kItem': 'item1',\n",
              "   'chunkId': '0000950170-23-027948-item1-chunk0005',\n",
              "   'chunkSeqId': 5}},\n",
              " {'from_same_section': {'formId': '0000950170-23-027948',\n",
              "   'f10kItem': 'item1',\n",
              "   'chunkId': '0000950170-23-027948-item1-chunk0006',\n",
              "   'chunkSeqId': 6}},\n",
              " {'from_same_section': {'formId': '0000950170-23-027948',\n",
              "   'f10kItem': 'item1',\n",
              "   'chunkId': '0000950170-23-027948-item1-chunk0007',\n",
              "   'chunkSeqId': 7}},\n",
              " {'from_same_section': {'formId': '0000950170-23-027948',\n",
              "   'f10kItem': 'item1',\n",
              "   'chunkId': '0000950170-23-027948-item1-chunk0008',\n",
              "   'chunkSeqId': 8}},\n",
              " {'from_same_section': {'formId': '0000950170-23-027948',\n",
              "   'f10kItem': 'item1',\n",
              "   'chunkId': '0000950170-23-027948-item1-chunk0009',\n",
              "   'chunkSeqId': 9}}]"
            ]
          },
          "metadata": {},
          "execution_count": 17
        }
      ]
    },
    {
      "cell_type": "markdown",
      "source": [
        "- Collect ordered chunks into a list"
      ],
      "metadata": {
        "id": "RudGUeMsUWpH"
      }
    },
    {
      "cell_type": "code",
      "source": [
        "cypher = \"\"\"\n",
        "  MATCH (from_same_section:Chunk)\n",
        "  WHERE from_same_section.formId = $formIdParam\n",
        "    AND from_same_section.f10kItem = $f10kItemParam\n",
        "  WITH from_same_section { .formId, .f10kItem, .chunkId, .chunkSeqId }\n",
        "    ORDER BY from_same_section.chunkSeqId ASC\n",
        "    LIMIT 10\n",
        "  RETURN collect(from_same_section) // NEW!!!\n",
        "\"\"\"\n",
        "\n",
        "kg.query(cypher, params={'formIdParam': form_info['formId'],\n",
        "                         'f10kItemParam': 'item1'})"
      ],
      "metadata": {
        "colab": {
          "base_uri": "https://localhost:8080/"
        },
        "id": "9IhiW0T3UZRz",
        "outputId": "0144a5d2-0e7f-4727-e7cd-6ef70369a649"
      },
      "execution_count": 18,
      "outputs": [
        {
          "output_type": "execute_result",
          "data": {
            "text/plain": [
              "[{'collect(from_same_section)': [{'formId': '0000950170-23-027948',\n",
              "    'f10kItem': 'item1',\n",
              "    'chunkId': '0000950170-23-027948-item1-chunk0000',\n",
              "    'chunkSeqId': 0},\n",
              "   {'formId': '0000950170-23-027948',\n",
              "    'f10kItem': 'item1',\n",
              "    'chunkId': '0000950170-23-027948-item1-chunk0001',\n",
              "    'chunkSeqId': 1},\n",
              "   {'formId': '0000950170-23-027948',\n",
              "    'f10kItem': 'item1',\n",
              "    'chunkId': '0000950170-23-027948-item1-chunk0002',\n",
              "    'chunkSeqId': 2},\n",
              "   {'formId': '0000950170-23-027948',\n",
              "    'f10kItem': 'item1',\n",
              "    'chunkId': '0000950170-23-027948-item1-chunk0003',\n",
              "    'chunkSeqId': 3},\n",
              "   {'formId': '0000950170-23-027948',\n",
              "    'f10kItem': 'item1',\n",
              "    'chunkId': '0000950170-23-027948-item1-chunk0004',\n",
              "    'chunkSeqId': 4},\n",
              "   {'formId': '0000950170-23-027948',\n",
              "    'f10kItem': 'item1',\n",
              "    'chunkId': '0000950170-23-027948-item1-chunk0005',\n",
              "    'chunkSeqId': 5},\n",
              "   {'formId': '0000950170-23-027948',\n",
              "    'f10kItem': 'item1',\n",
              "    'chunkId': '0000950170-23-027948-item1-chunk0006',\n",
              "    'chunkSeqId': 6},\n",
              "   {'formId': '0000950170-23-027948',\n",
              "    'f10kItem': 'item1',\n",
              "    'chunkId': '0000950170-23-027948-item1-chunk0007',\n",
              "    'chunkSeqId': 7},\n",
              "   {'formId': '0000950170-23-027948',\n",
              "    'f10kItem': 'item1',\n",
              "    'chunkId': '0000950170-23-027948-item1-chunk0008',\n",
              "    'chunkSeqId': 8},\n",
              "   {'formId': '0000950170-23-027948',\n",
              "    'f10kItem': 'item1',\n",
              "    'chunkId': '0000950170-23-027948-item1-chunk0009',\n",
              "    'chunkSeqId': 9}]}]"
            ]
          },
          "metadata": {},
          "execution_count": 18
        }
      ]
    },
    {
      "cell_type": "markdown",
      "source": [
        "### Add a NEXT relationship between subsequent chunks\n",
        "- Used the `apoc.nodes.link` function from Neo4j to link ordered list of `Chunk` nodes with a `NEXT` relationship"
      ],
      "metadata": {
        "id": "9NyjJyhgUiwG"
      }
    },
    {
      "cell_type": "code",
      "source": [
        "cypher = \"\"\"\n",
        "  MATCH (from_same_section:Chunk)\n",
        "  WHERE from_same_section.formId = $formIdParam\n",
        "    AND from_same_section.f10kItem = $f10kItemParam\n",
        "  WITH from_same_section\n",
        "    ORDER BY from_same_section.chunkSeqId ASC\n",
        "  WITH collect(from_same_section) as section_chunk_list\n",
        "    CALL apoc.nodes.link(\n",
        "        section_chunk_list,\n",
        "        \"NEXT\",\n",
        "        {avoidDuplicates: true}\n",
        "    )\n",
        "  RETURN size(section_chunk_list)\n",
        "\"\"\"\n",
        "\n",
        "kg.query(cypher, params={'formIdParam': form_info['formId'],\n",
        "                         'f10kItemParam': 'item1'})"
      ],
      "metadata": {
        "colab": {
          "base_uri": "https://localhost:8080/"
        },
        "id": "1Ia54OqxUmoa",
        "outputId": "d6747235-271f-4af8-d1c7-ccba165d5d24"
      },
      "execution_count": 19,
      "outputs": [
        {
          "output_type": "execute_result",
          "data": {
            "text/plain": [
              "[{'size(section_chunk_list)': 254}]"
            ]
          },
          "metadata": {},
          "execution_count": 19
        }
      ]
    },
    {
      "cell_type": "code",
      "source": [
        "kg.refresh_schema()\n",
        "print(kg.schema)"
      ],
      "metadata": {
        "colab": {
          "base_uri": "https://localhost:8080/"
        },
        "id": "hxmizLPKUyXW",
        "outputId": "02f6dd93-e9e2-4de5-86ce-1911d0f77207"
      },
      "execution_count": 20,
      "outputs": [
        {
          "output_type": "stream",
          "name": "stdout",
          "text": [
            "Node properties:\n",
            "Chunk {chunkId: STRING, names: LIST, formId: STRING, cik: STRING, cusip6: STRING, source: STRING, f10kItem: STRING, chunkSeqId: INTEGER, text: STRING, textEmbedding: LIST}\n",
            "Form {names: LIST, formId: STRING, cik: STRING, cusip6: STRING, source: STRING}\n",
            "Relationship properties:\n",
            "\n",
            "The relationships:\n",
            "(:Chunk)-[:NEXT]->(:Chunk)\n"
          ]
        }
      ]
    },
    {
      "cell_type": "markdown",
      "source": [
        "- Loop through and create relationships for all sections of the form 10-K"
      ],
      "metadata": {
        "id": "pBJpqGqfU1M1"
      }
    },
    {
      "cell_type": "code",
      "source": [
        "cypher = \"\"\"\n",
        "  MATCH (from_same_section:Chunk)\n",
        "  WHERE from_same_section.formId = $formIdParam\n",
        "    AND from_same_section.f10kItem = $f10kItemParam\n",
        "  WITH from_same_section\n",
        "    ORDER BY from_same_section.chunkSeqId ASC\n",
        "  WITH collect(from_same_section) as section_chunk_list\n",
        "    CALL apoc.nodes.link(\n",
        "        section_chunk_list,\n",
        "        \"NEXT\",\n",
        "        {avoidDuplicates: true}\n",
        "    )\n",
        "  RETURN size(section_chunk_list)\n",
        "\"\"\"\n",
        "for form10kItemName in ['item1', 'item1a', 'item7', 'item7a']:\n",
        "  kg.query(cypher, params={'formIdParam':form_info['formId'],\n",
        "                           'f10kItemParam': form10kItemName})"
      ],
      "metadata": {
        "id": "9DfDMEdfUyy-"
      },
      "execution_count": 21,
      "outputs": []
    },
    {
      "cell_type": "markdown",
      "source": [
        "### Connect chunks to their parent form with a PART_OF relationship"
      ],
      "metadata": {
        "id": "X57OKq2IU9yk"
      }
    },
    {
      "cell_type": "code",
      "source": [
        "cypher = \"\"\"\n",
        "  MATCH (c:Chunk), (f:Form)\n",
        "    WHERE c.formId = f.formId\n",
        "  MERGE (c)-[newRelationship:PART_OF]->(f)\n",
        "  RETURN count(newRelationship)\n",
        "\"\"\"\n",
        "\n",
        "kg.query(cypher)"
      ],
      "metadata": {
        "colab": {
          "base_uri": "https://localhost:8080/"
        },
        "id": "I4mHdjUwU3af",
        "outputId": "27282a0a-a4d8-4744-9920-7da0c1d778bf"
      },
      "execution_count": 22,
      "outputs": [
        {
          "output_type": "execute_result",
          "data": {
            "text/plain": [
              "[{'count(newRelationship)': 257}]"
            ]
          },
          "metadata": {},
          "execution_count": 22
        }
      ]
    },
    {
      "cell_type": "markdown",
      "source": [
        "### Create a SECTION relationship on first chunk of each section"
      ],
      "metadata": {
        "id": "6vSqkHtrVdo9"
      }
    },
    {
      "cell_type": "code",
      "source": [
        "cypher = \"\"\"\n",
        "  MATCH (first:Chunk), (f:Form)\n",
        "  WHERE first.formId = f.formId\n",
        "    AND first.chunkSeqId = 0\n",
        "  WITH first, f\n",
        "    MERGE (f)-[r:SECTION {f10kItem: first.f10kItem}]->(first)\n",
        "  RETURN count(r)\n",
        "\"\"\"\n",
        "\n",
        "kg.query(cypher)"
      ],
      "metadata": {
        "colab": {
          "base_uri": "https://localhost:8080/"
        },
        "id": "bUm1hj0oVAY3",
        "outputId": "3f7d5940-ce77-483c-adbe-6e03aaf7dfa8"
      },
      "execution_count": 23,
      "outputs": [
        {
          "output_type": "execute_result",
          "data": {
            "text/plain": [
              "[{'count(r)': 4}]"
            ]
          },
          "metadata": {},
          "execution_count": 23
        }
      ]
    },
    {
      "cell_type": "markdown",
      "source": [
        "# Adding Form 13"
      ],
      "metadata": {
        "id": "AgVQ-5fK0UMA"
      }
    },
    {
      "cell_type": "code",
      "source": [
        "import csv\n",
        "\n",
        "all_form13s = []\n",
        "\n",
        "with open('/content/form13.csv', mode='r') as csv_file:\n",
        "    csv_reader = csv.DictReader(csv_file)\n",
        "    for row in csv_reader: # each row will be a dictionary\n",
        "      all_form13s.append(row)"
      ],
      "metadata": {
        "id": "DchXciFiVivh"
      },
      "execution_count": 6,
      "outputs": []
    },
    {
      "cell_type": "code",
      "source": [
        "all_form13s[0:5]"
      ],
      "metadata": {
        "colab": {
          "base_uri": "https://localhost:8080/"
        },
        "id": "nA7_8-eL0gbn",
        "outputId": "51778116-c9a8-4c87-9069-856e5987b623"
      },
      "execution_count": 7,
      "outputs": [
        {
          "output_type": "execute_result",
          "data": {
            "text/plain": [
              "[{'source': 'https://sec.gov/Archives/edgar/data/1000275/0001140361-23-039575.txt',\n",
              "  'managerCik': '1000275',\n",
              "  'managerAddress': 'ROYAL BANK PLAZA, 200 BAY STREET, TORONTO, A6, M5J2J5',\n",
              "  'managerName': 'Royal Bank of Canada',\n",
              "  'reportCalendarOrQuarter': '2023-06-30',\n",
              "  'cusip6': '64110D',\n",
              "  'cusip': '64110D104',\n",
              "  'companyName': 'NETAPP INC',\n",
              "  'value': '64395000000.0',\n",
              "  'shares': '842850'},\n",
              " {'source': 'https://sec.gov/Archives/edgar/data/1002784/0001387131-23-009542.txt',\n",
              "  'managerCik': '1002784',\n",
              "  'managerAddress': '1875 Lawrence Street, Suite 300, Denver, CO, 80202-1805',\n",
              "  'managerName': 'SHELTON CAPITAL MANAGEMENT',\n",
              "  'reportCalendarOrQuarter': '2023-06-30',\n",
              "  'cusip6': '64110D',\n",
              "  'cusip': '64110D104',\n",
              "  'companyName': 'NETAPP INC',\n",
              "  'value': '2989085000.0',\n",
              "  'shares': '39124'},\n",
              " {'source': 'https://sec.gov/Archives/edgar/data/1007280/0001007280-23-000008.txt',\n",
              "  'managerCik': '1007280',\n",
              "  'managerAddress': '277 E TOWN ST, COLUMBUS, OH, 43215',\n",
              "  'managerName': 'PUBLIC EMPLOYEES RETIREMENT SYSTEM OF OHIO',\n",
              "  'reportCalendarOrQuarter': '2023-06-30',\n",
              "  'cusip6': '64110D',\n",
              "  'cusip': '64110D104',\n",
              "  'companyName': 'Netapp Inc',\n",
              "  'value': '8170000.0',\n",
              "  'shares': '106941'},\n",
              " {'source': 'https://sec.gov/Archives/edgar/data/1007399/0001007399-23-000004.txt',\n",
              "  'managerCik': '1007399',\n",
              "  'managerAddress': '150 WEST MAIN STREET, SUITE 1700, NORFOLK, VA, 23510',\n",
              "  'managerName': 'WILBANKS SMITH & THOMAS ASSET MANAGEMENT LLC',\n",
              "  'reportCalendarOrQuarter': '2023-06-30',\n",
              "  'cusip6': '64110D',\n",
              "  'cusip': '64110D104',\n",
              "  'companyName': 'NETAPP INC',\n",
              "  'value': '505539000.0',\n",
              "  'shares': '6617'},\n",
              " {'source': 'https://sec.gov/Archives/edgar/data/1008894/0001172661-23-003025.txt',\n",
              "  'managerCik': '1008894',\n",
              "  'managerAddress': '250 Park Avenue South, Suite 250, Winter Park, FL, 32789',\n",
              "  'managerName': 'DEPRINCE RACE & ZOLLO INC',\n",
              "  'reportCalendarOrQuarter': '2023-06-30',\n",
              "  'cusip6': '64110D',\n",
              "  'cusip': '64110D104',\n",
              "  'companyName': 'NETAPP INC',\n",
              "  'value': '24492389000.0',\n",
              "  'shares': '320581'}]"
            ]
          },
          "metadata": {},
          "execution_count": 7
        }
      ]
    },
    {
      "cell_type": "code",
      "source": [
        "len(all_form13s)"
      ],
      "metadata": {
        "colab": {
          "base_uri": "https://localhost:8080/"
        },
        "id": "wURv9Xgn0hV6",
        "outputId": "0839151b-cdc7-434c-df52-922a51ec680c"
      },
      "execution_count": 8,
      "outputs": [
        {
          "output_type": "execute_result",
          "data": {
            "text/plain": [
              "561"
            ]
          },
          "metadata": {},
          "execution_count": 8
        }
      ]
    },
    {
      "cell_type": "markdown",
      "source": [
        "## Create company nodes in the graph\n",
        "- Use the companies identified in the Form 13s to create `Company` nodes"
      ],
      "metadata": {
        "id": "aDvcKdPA0ulX"
      }
    },
    {
      "cell_type": "code",
      "source": [
        "first_form13 = all_form13s[0]\n",
        "\n",
        "cypher = \"\"\"\n",
        "MERGE (com:Company {cusip6: $cusip6})\n",
        "  ON CREATE\n",
        "    SET com.companyName = $companyName,\n",
        "        com.cusip = $cusip\n",
        "\"\"\"\n",
        "\n",
        "kg.query(cypher, params={\n",
        "    'cusip6':first_form13['cusip6'],\n",
        "    'companyName':first_form13['companyName'],\n",
        "    'cusip':first_form13['cusip']\n",
        "})"
      ],
      "metadata": {
        "colab": {
          "base_uri": "https://localhost:8080/"
        },
        "id": "0YCB4FYt0w3r",
        "outputId": "6e6b3f2a-714e-4e9c-a4fe-5bea8a37a3e0"
      },
      "execution_count": 9,
      "outputs": [
        {
          "output_type": "execute_result",
          "data": {
            "text/plain": [
              "[]"
            ]
          },
          "metadata": {},
          "execution_count": 9
        }
      ]
    },
    {
      "cell_type": "code",
      "source": [
        "cypher = \"\"\"\n",
        "MATCH (com:Company)\n",
        "RETURN com LIMIT 1\n",
        "\"\"\"\n",
        "\n",
        "kg.query(cypher)"
      ],
      "metadata": {
        "colab": {
          "base_uri": "https://localhost:8080/"
        },
        "id": "rX6G9V5g1fbK",
        "outputId": "fa8697c0-4ba1-43ef-e6ae-a68fb0cb818a"
      },
      "execution_count": 10,
      "outputs": [
        {
          "output_type": "execute_result",
          "data": {
            "text/plain": [
              "[{'com': {'cusip': '64110D104',\n",
              "   'companyName': 'NETAPP INC',\n",
              "   'cusip6': '64110D'}}]"
            ]
          },
          "metadata": {},
          "execution_count": 10
        }
      ]
    },
    {
      "cell_type": "markdown",
      "source": [
        "- Update the company name to match Form 10-K"
      ],
      "metadata": {
        "id": "_fA8qCKx11Wm"
      }
    },
    {
      "cell_type": "code",
      "source": [
        "cypher = \"\"\"\n",
        "  MATCH (com:Company), (form:Form)\n",
        "    WHERE com.cusip6 = form.cusip6\n",
        "  RETURN com.companyName, form.names\n",
        "\"\"\"\n",
        "\n",
        "kg.query(cypher)"
      ],
      "metadata": {
        "colab": {
          "base_uri": "https://localhost:8080/"
        },
        "id": "yMgyAp_Q1mkb",
        "outputId": "cae6cfec-17d1-4329-b3b3-0700f07dec00"
      },
      "execution_count": 11,
      "outputs": [
        {
          "output_type": "execute_result",
          "data": {
            "text/plain": [
              "[{'com.companyName': 'NETAPP INC', 'form.names': ['Netapp Inc', 'NETAPP INC']}]"
            ]
          },
          "metadata": {},
          "execution_count": 11
        }
      ]
    },
    {
      "cell_type": "code",
      "source": [
        "cypher = \"\"\"\n",
        "  MATCH (com:Company), (form:Form)\n",
        "    WHERE com.cusip6 = form.cusip6\n",
        "  SET com.names = form.names\n",
        "\"\"\"\n",
        "\n",
        "kg.query(cypher)"
      ],
      "metadata": {
        "colab": {
          "base_uri": "https://localhost:8080/"
        },
        "id": "xYYbs4eI17sP",
        "outputId": "bddaf5c6-e655-4637-b5d2-d57b03e63e25"
      },
      "execution_count": 12,
      "outputs": [
        {
          "output_type": "execute_result",
          "data": {
            "text/plain": [
              "[]"
            ]
          },
          "metadata": {},
          "execution_count": 12
        }
      ]
    },
    {
      "cell_type": "markdown",
      "source": [
        "- Create a `FILED` relationship between the company and the Form-10K node"
      ],
      "metadata": {
        "id": "m2zSU-DA2E6L"
      }
    },
    {
      "cell_type": "code",
      "source": [
        "kg.query(\"\"\"\n",
        "  MATCH (com:Company), (form:Form)\n",
        "    WHERE com.cusip6 = form.cusip6\n",
        "  MERGE (com)-[:FILED]->(form)\n",
        "\"\"\")"
      ],
      "metadata": {
        "colab": {
          "base_uri": "https://localhost:8080/"
        },
        "id": "M_go_v-71-Dr",
        "outputId": "1551c8fe-d308-4a2c-cf5a-c183f3a665ca"
      },
      "execution_count": 13,
      "outputs": [
        {
          "output_type": "execute_result",
          "data": {
            "text/plain": [
              "[]"
            ]
          },
          "metadata": {},
          "execution_count": 13
        }
      ]
    },
    {
      "cell_type": "markdown",
      "source": [
        "## Create manager nodes\n",
        "- Create a `manager` node for companies that have filed a Form 13 to report their investment in NetApp"
      ],
      "metadata": {
        "id": "R166aUMr2Nck"
      }
    },
    {
      "cell_type": "code",
      "source": [
        "cypher = \"\"\"\n",
        "  MERGE (mgr:Manager {managerCik: $managerParam.managerCik})\n",
        "    ON CREATE\n",
        "        SET mgr.managerName = $managerParam.managerName,\n",
        "            mgr.managerAddress = $managerParam.managerAddress\n",
        "\"\"\"\n",
        "\n",
        "kg.query(cypher, params={'managerParam': first_form13})"
      ],
      "metadata": {
        "colab": {
          "base_uri": "https://localhost:8080/"
        },
        "id": "Z14g3ZUw2RUS",
        "outputId": "a0069bb6-ea18-43cf-ad46-25da144d3ae3"
      },
      "execution_count": 14,
      "outputs": [
        {
          "output_type": "execute_result",
          "data": {
            "text/plain": [
              "[]"
            ]
          },
          "metadata": {},
          "execution_count": 14
        }
      ]
    },
    {
      "cell_type": "code",
      "source": [
        "kg.query(\"\"\"\n",
        "  MATCH (mgr:Manager)\n",
        "  RETURN mgr LIMIT 1\n",
        "\"\"\")"
      ],
      "metadata": {
        "colab": {
          "base_uri": "https://localhost:8080/"
        },
        "id": "AdK3WmUK2Tmg",
        "outputId": "056481fb-b526-475d-d53b-3e5ebb1d2d5f"
      },
      "execution_count": 15,
      "outputs": [
        {
          "output_type": "execute_result",
          "data": {
            "text/plain": [
              "[{'mgr': {'managerCik': '1000275',\n",
              "   'managerAddress': 'ROYAL BANK PLAZA, 200 BAY STREET, TORONTO, A6, M5J2J5',\n",
              "   'managerName': 'Royal Bank of Canada'}}]"
            ]
          },
          "metadata": {},
          "execution_count": 15
        }
      ]
    },
    {
      "cell_type": "markdown",
      "source": [
        "- Create a uniquness constraint to avoid duplicate managers"
      ],
      "metadata": {
        "id": "mqn-kCoW2ZAi"
      }
    },
    {
      "cell_type": "code",
      "source": [
        "kg.query(\"\"\"\n",
        "CREATE CONSTRAINT unique_manager\n",
        "  IF NOT EXISTS\n",
        "  FOR (n:Manager)\n",
        "  REQUIRE n.managerCik IS UNIQUE\n",
        "\"\"\")"
      ],
      "metadata": {
        "colab": {
          "base_uri": "https://localhost:8080/"
        },
        "id": "7xzND5H02Vrl",
        "outputId": "876514d8-eda8-4d2c-834a-7ee8678b08b4"
      },
      "execution_count": 16,
      "outputs": [
        {
          "output_type": "execute_result",
          "data": {
            "text/plain": [
              "[]"
            ]
          },
          "metadata": {},
          "execution_count": 16
        }
      ]
    },
    {
      "cell_type": "markdown",
      "source": [
        "- Create a fulltext index of manager names to enable text search"
      ],
      "metadata": {
        "id": "AjdcBEhj2cxC"
      }
    },
    {
      "cell_type": "code",
      "source": [
        "kg.query(\"\"\"\n",
        "CREATE FULLTEXT INDEX fullTextManagerNames\n",
        "  IF NOT EXISTS\n",
        "  FOR (mgr:Manager)\n",
        "  ON EACH [mgr.managerName]\n",
        "\"\"\")"
      ],
      "metadata": {
        "colab": {
          "base_uri": "https://localhost:8080/"
        },
        "id": "4cOhL9PP2ay0",
        "outputId": "be2d4f07-cd65-4e4e-fca4-8942d7940c1d"
      },
      "execution_count": 17,
      "outputs": [
        {
          "output_type": "execute_result",
          "data": {
            "text/plain": [
              "[]"
            ]
          },
          "metadata": {},
          "execution_count": 17
        }
      ]
    },
    {
      "cell_type": "code",
      "source": [
        "kg.query(\"\"\"\n",
        "  CALL db.index.fulltext.queryNodes(\"fullTextManagerNames\",\n",
        "      \"royal bank\") YIELD node, score\n",
        "  RETURN node.managerName, score\n",
        "\"\"\")"
      ],
      "metadata": {
        "colab": {
          "base_uri": "https://localhost:8080/"
        },
        "id": "qYU1MaQR2jq4",
        "outputId": "a7a2a10e-b9b9-449f-d71e-1e1540ba443e"
      },
      "execution_count": 18,
      "outputs": [
        {
          "output_type": "execute_result",
          "data": {
            "text/plain": [
              "[{'node.managerName': 'Royal Bank of Canada', 'score': 0.2615291476249695}]"
            ]
          },
          "metadata": {},
          "execution_count": 18
        }
      ]
    },
    {
      "cell_type": "markdown",
      "source": [
        "- Create nodes for all companies that filed a Form 13"
      ],
      "metadata": {
        "id": "L6sjbDFL2oKq"
      }
    },
    {
      "cell_type": "code",
      "source": [
        "cypher = \"\"\"\n",
        "  MERGE (mgr:Manager {managerCik: $managerParam.managerCik})\n",
        "    ON CREATE\n",
        "        SET mgr.managerName = $managerParam.managerName,\n",
        "            mgr.managerAddress = $managerParam.managerAddress\n",
        "\"\"\"\n",
        "# loop through all Form 13\n",
        "for form13 in all_form13s:\n",
        "  kg.query(cypher, params={'managerParam': form13 })"
      ],
      "metadata": {
        "id": "iBt6M07M2kzL"
      },
      "execution_count": 19,
      "outputs": []
    },
    {
      "cell_type": "code",
      "source": [
        "kg.query(\"\"\"\n",
        "    MATCH (mgr:Manager)\n",
        "    RETURN count(mgr)\n",
        "\"\"\")"
      ],
      "metadata": {
        "colab": {
          "base_uri": "https://localhost:8080/"
        },
        "id": "g0SkcTOj2uSf",
        "outputId": "b6820a98-ddc3-4003-ecec-31c6a8c83bff"
      },
      "execution_count": 20,
      "outputs": [
        {
          "output_type": "execute_result",
          "data": {
            "text/plain": [
              "[{'count(mgr)': 561}]"
            ]
          },
          "metadata": {},
          "execution_count": 20
        }
      ]
    },
    {
      "cell_type": "markdown",
      "source": [
        "## Create relationships between managers and companies\n",
        "- Match companies with managers based on data in the Form 13\n",
        "- Create an `OWNS_STOCK_IN` relationship between the manager and the company"
      ],
      "metadata": {
        "id": "WGdhjatK4LI0"
      }
    },
    {
      "cell_type": "code",
      "source": [
        "cypher = \"\"\"\n",
        "  MATCH (mgr:Manager {managerCik: $investmentParam.managerCik}),\n",
        "        (com:Company {cusip6: $investmentParam.cusip6})\n",
        "  RETURN mgr.managerName, com.companyName, $investmentParam as investment\n",
        "\"\"\"\n",
        "\n",
        "kg.query(cypher, params={\n",
        "    'investmentParam': first_form13\n",
        "})"
      ],
      "metadata": {
        "colab": {
          "base_uri": "https://localhost:8080/"
        },
        "id": "QnRsncOS4GrI",
        "outputId": "72f1a235-767e-4a4b-a213-da37174f49cf"
      },
      "execution_count": 21,
      "outputs": [
        {
          "output_type": "execute_result",
          "data": {
            "text/plain": [
              "[{'mgr.managerName': 'Royal Bank of Canada',\n",
              "  'com.companyName': 'NETAPP INC',\n",
              "  'investment': {'managerCik': '1000275',\n",
              "   'shares': '842850',\n",
              "   'cusip': '64110D104',\n",
              "   'managerAddress': 'ROYAL BANK PLAZA, 200 BAY STREET, TORONTO, A6, M5J2J5',\n",
              "   'reportCalendarOrQuarter': '2023-06-30',\n",
              "   'companyName': 'NETAPP INC',\n",
              "   'cusip6': '64110D',\n",
              "   'source': 'https://sec.gov/Archives/edgar/data/1000275/0001140361-23-039575.txt',\n",
              "   'managerName': 'Royal Bank of Canada',\n",
              "   'value': '64395000000.0'}}]"
            ]
          },
          "metadata": {},
          "execution_count": 21
        }
      ]
    },
    {
      "cell_type": "code",
      "source": [
        "cypher = \"\"\"\n",
        "MATCH (mgr:Manager {managerCik: $ownsParam.managerCik}),\n",
        "        (com:Company {cusip6: $ownsParam.cusip6})\n",
        "MERGE (mgr)-[owns:OWNS_STOCK_IN {\n",
        "    reportCalendarOrQuarter: $ownsParam.reportCalendarOrQuarter\n",
        "}]->(com)\n",
        "ON CREATE\n",
        "    SET owns.value  = toFloat($ownsParam.value),\n",
        "        owns.shares = toInteger($ownsParam.shares)\n",
        "RETURN mgr.managerName, owns.reportCalendarOrQuarter, com.companyName\n",
        "\"\"\"\n",
        "\n",
        "kg.query(cypher, params={ 'ownsParam': first_form13 })"
      ],
      "metadata": {
        "colab": {
          "base_uri": "https://localhost:8080/"
        },
        "id": "-DflZipt4Sm6",
        "outputId": "17ceead6-0624-496b-b67a-75542e9cc37d"
      },
      "execution_count": 22,
      "outputs": [
        {
          "output_type": "execute_result",
          "data": {
            "text/plain": [
              "[{'mgr.managerName': 'Royal Bank of Canada',\n",
              "  'owns.reportCalendarOrQuarter': '2023-06-30',\n",
              "  'com.companyName': 'NETAPP INC'}]"
            ]
          },
          "metadata": {},
          "execution_count": 22
        }
      ]
    },
    {
      "cell_type": "code",
      "source": [
        "kg.query(\"\"\"\n",
        "MATCH (mgr:Manager {managerCik: $ownsParam.managerCik})\n",
        "-[owns:OWNS_STOCK_IN]->\n",
        "        (com:Company {cusip6: $ownsParam.cusip6})\n",
        "RETURN owns { .shares, .value }\n",
        "\"\"\", params={ 'ownsParam': first_form13 })"
      ],
      "metadata": {
        "colab": {
          "base_uri": "https://localhost:8080/"
        },
        "id": "suugmxMQ4TLP",
        "outputId": "aa83211e-81ab-4413-890d-ed5edcfa976d"
      },
      "execution_count": 23,
      "outputs": [
        {
          "output_type": "execute_result",
          "data": {
            "text/plain": [
              "[{'owns': {'shares': 842850, 'value': 64395000000.0}}]"
            ]
          },
          "metadata": {},
          "execution_count": 23
        }
      ]
    },
    {
      "cell_type": "markdown",
      "source": [
        "- Create relationships between all of the managers who filed Form 13 and the company"
      ],
      "metadata": {
        "id": "P3rkXYyS4Xhr"
      }
    },
    {
      "cell_type": "code",
      "source": [
        "cypher = \"\"\"\n",
        "MATCH (mgr:Manager {managerCik: $ownsParam.managerCik}),\n",
        "        (com:Company {cusip6: $ownsParam.cusip6})\n",
        "MERGE (mgr)-[owns:OWNS_STOCK_IN {\n",
        "    reportCalendarOrQuarter: $ownsParam.reportCalendarOrQuarter\n",
        "    }]->(com)\n",
        "  ON CREATE\n",
        "    SET owns.value  = toFloat($ownsParam.value),\n",
        "        owns.shares = toInteger($ownsParam.shares)\n",
        "\"\"\"\n",
        "\n",
        "#loop through all Form 13s\n",
        "for form13 in all_form13s:\n",
        "  kg.query(cypher, params={'ownsParam': form13 })"
      ],
      "metadata": {
        "id": "DDEd6--d4V6u"
      },
      "execution_count": 24,
      "outputs": []
    },
    {
      "cell_type": "code",
      "source": [
        "cypher = \"\"\"\n",
        "  MATCH (:Manager)-[owns:OWNS_STOCK_IN]->(:Company)\n",
        "  RETURN count(owns) as investments\n",
        "\"\"\"\n",
        "\n",
        "kg.query(cypher)"
      ],
      "metadata": {
        "colab": {
          "base_uri": "https://localhost:8080/"
        },
        "id": "FVSBQ3Hu4c69",
        "outputId": "df0cee7b-7bdf-487e-a32f-8c8dfcf72cff"
      },
      "execution_count": 25,
      "outputs": [
        {
          "output_type": "execute_result",
          "data": {
            "text/plain": [
              "[{'investments': 561}]"
            ]
          },
          "metadata": {},
          "execution_count": 25
        }
      ]
    },
    {
      "cell_type": "code",
      "source": [
        "kg.refresh_schema()\n",
        "print(textwrap.fill(kg.schema, 60))"
      ],
      "metadata": {
        "colab": {
          "base_uri": "https://localhost:8080/"
        },
        "id": "LluM0H554jCa",
        "outputId": "acd0bb90-7981-4bf9-cb3d-f581fde617aa"
      },
      "execution_count": 26,
      "outputs": [
        {
          "output_type": "stream",
          "name": "stdout",
          "text": [
            "Node properties: Chunk {chunkId: STRING, names: LIST,\n",
            "formId: STRING, cik: STRING, cusip6: STRING, source: STRING,\n",
            "f10kItem: STRING, chunkSeqId: INTEGER, text: STRING,\n",
            "textEmbedding: LIST} Form {names: LIST, formId: STRING, cik:\n",
            "STRING, cusip6: STRING, source: STRING} Company {names:\n",
            "LIST, cusip6: STRING, companyName: STRING, cusip: STRING}\n",
            "Manager {managerCik: STRING, managerName: STRING,\n",
            "managerAddress: STRING} Relationship properties: SECTION\n",
            "{f10kItem: STRING} OWNS_STOCK_IN {reportCalendarOrQuarter:\n",
            "STRING, value: FLOAT, shares: INTEGER} The relationships:\n",
            "(:Chunk)-[:NEXT]->(:Chunk) (:Chunk)-[:PART_OF]->(:Form)\n",
            "(:Form)-[:SECTION]->(:Chunk) (:Company)-[:FILED]->(:Form)\n",
            "(:Manager)-[:OWNS_STOCK_IN]->(:Company)\n"
          ]
        }
      ]
    },
    {
      "cell_type": "markdown",
      "source": [
        "## Determine the number of investors\n",
        "- Start by finding a form 10-K chunk, and save to use in subsequent queries"
      ],
      "metadata": {
        "id": "ryMu6D5N7Z2-"
      }
    },
    {
      "cell_type": "code",
      "source": [
        "cypher = \"\"\"\n",
        "    MATCH (chunk:Chunk)\n",
        "    RETURN chunk.chunkId as chunkId LIMIT 1\n",
        "    \"\"\"\n",
        "\n",
        "chunk_rows = kg.query(cypher)\n",
        "print(chunk_rows)"
      ],
      "metadata": {
        "colab": {
          "base_uri": "https://localhost:8080/"
        },
        "id": "-PDjSf5I7dgW",
        "outputId": "81f38ab2-2389-4031-8d63-a40b17a2a733"
      },
      "execution_count": 27,
      "outputs": [
        {
          "output_type": "stream",
          "name": "stdout",
          "text": [
            "[{'chunkId': '0000950170-23-027948-item1-chunk0000'}]\n"
          ]
        }
      ]
    },
    {
      "cell_type": "code",
      "source": [
        "chunk_first_row = chunk_rows[0]\n",
        "print(chunk_first_row)"
      ],
      "metadata": {
        "colab": {
          "base_uri": "https://localhost:8080/"
        },
        "id": "rtRngf4b7f6D",
        "outputId": "5ea93416-db6a-42cf-916c-076dac16d3c7"
      },
      "execution_count": 28,
      "outputs": [
        {
          "output_type": "stream",
          "name": "stdout",
          "text": [
            "{'chunkId': '0000950170-23-027948-item1-chunk0000'}\n"
          ]
        }
      ]
    },
    {
      "cell_type": "markdown",
      "source": [
        "- Build up path from Form 10-K chunk to companies and managers"
      ],
      "metadata": {
        "id": "L3Erzl037sXV"
      }
    },
    {
      "cell_type": "code",
      "source": [
        "cypher = \"\"\"\n",
        "    MATCH (:Chunk {chunkId: $chunkIdParam})-[:PART_OF]->(f:Form)\n",
        "    RETURN f.source\n",
        "    \"\"\"\n",
        "\n",
        "kg.query(cypher, params={'chunkIdParam': ref_chunk_id})"
      ],
      "metadata": {
        "colab": {
          "base_uri": "https://localhost:8080/"
        },
        "id": "Po_UzSrz7mDA",
        "outputId": "7b9a0bc0-fac5-4f9d-aa61-1268578539ed"
      },
      "execution_count": 30,
      "outputs": [
        {
          "output_type": "execute_result",
          "data": {
            "text/plain": [
              "[{'f.source': 'https://www.sec.gov/Archives/edgar/data/1002047/000095017023027948/0000950170-23-027948-index.htm'}]"
            ]
          },
          "metadata": {},
          "execution_count": 30
        }
      ]
    },
    {
      "cell_type": "code",
      "source": [
        "cypher = \"\"\"\n",
        "MATCH (:Chunk {chunkId: $chunkIdParam})-[:PART_OF]->(f:Form),\n",
        "    (com:Company)-[:FILED]->(f)\n",
        "RETURN com.companyName as name\n",
        "\"\"\"\n",
        "\n",
        "kg.query(cypher, params={'chunkIdParam': ref_chunk_id})"
      ],
      "metadata": {
        "colab": {
          "base_uri": "https://localhost:8080/"
        },
        "id": "kKCGmU777vwL",
        "outputId": "1c626650-c599-455d-f6b7-37408ef490a9"
      },
      "execution_count": 31,
      "outputs": [
        {
          "output_type": "execute_result",
          "data": {
            "text/plain": [
              "[{'name': 'NETAPP INC'}]"
            ]
          },
          "metadata": {},
          "execution_count": 31
        }
      ]
    },
    {
      "cell_type": "code",
      "source": [
        "cypher = \"\"\"\n",
        "MATCH (:Chunk {chunkId: $chunkIdParam})-[:PART_OF]->(f:Form),\n",
        "        (com:Company)-[:FILED]->(f),\n",
        "        (mgr:Manager)-[:OWNS_STOCK_IN]->(com)\n",
        "RETURN com.companyName,\n",
        "        count(mgr.managerName) as numberOfinvestors\n",
        "LIMIT 1\n",
        "\"\"\"\n",
        "\n",
        "kg.query(cypher, params={\n",
        "    'chunkIdParam': ref_chunk_id\n",
        "})"
      ],
      "metadata": {
        "colab": {
          "base_uri": "https://localhost:8080/"
        },
        "id": "tb_aYU3_7zih",
        "outputId": "c26954d8-688a-4648-bd7a-5775cbf95278"
      },
      "execution_count": 32,
      "outputs": [
        {
          "output_type": "execute_result",
          "data": {
            "text/plain": [
              "[{'com.companyName': 'NETAPP INC', 'numberOfinvestors': 561}]"
            ]
          },
          "metadata": {},
          "execution_count": 32
        }
      ]
    },
    {
      "cell_type": "markdown",
      "source": [
        "- how much stock a manager has invested in a company"
      ],
      "metadata": {
        "id": "SkAWLhcMDSQO"
      }
    },
    {
      "cell_type": "code",
      "source": [
        "cypher = \"\"\"\n",
        "    MATCH (:Chunk {chunkId: $chunkIdParam})-[:PART_OF]->(f:Form),\n",
        "        (com:Company)-[:FILED]->(f),\n",
        "        (mgr:Manager)-[owns:OWNS_STOCK_IN]->(com)\n",
        "    RETURN mgr.managerName + \" owns \" + owns.shares +\n",
        "        \" shares of \" + com.companyName +\n",
        "        \" at a value of $\" +\n",
        "        apoc.number.format(toInteger(owns.value)) AS text\n",
        "    LIMIT 10\n",
        "    \"\"\"\n",
        "kg.query(cypher, params={\n",
        "    'chunkIdParam': ref_chunk_id\n",
        "})"
      ],
      "metadata": {
        "colab": {
          "base_uri": "https://localhost:8080/"
        },
        "id": "1FO4HC3D74WE",
        "outputId": "0b215ac9-bff6-4f44-a1c3-dc6be7effcce"
      },
      "execution_count": 33,
      "outputs": [
        {
          "output_type": "execute_result",
          "data": {
            "text/plain": [
              "[{'text': 'Royal Bank of Canada owns 842850 shares of NETAPP INC at a value of $64,395,000,000'},\n",
              " {'text': 'SHELTON CAPITAL MANAGEMENT owns 39124 shares of NETAPP INC at a value of $2,989,085,000'},\n",
              " {'text': 'PUBLIC EMPLOYEES RETIREMENT SYSTEM OF OHIO owns 106941 shares of NETAPP INC at a value of $8,170,000'},\n",
              " {'text': 'WILBANKS SMITH & THOMAS ASSET MANAGEMENT LLC owns 6617 shares of NETAPP INC at a value of $505,539,000'},\n",
              " {'text': 'DEPRINCE RACE & ZOLLO INC owns 320581 shares of NETAPP INC at a value of $24,492,389,000'},\n",
              " {'text': 'COMMERCE BANK owns 101422 shares of NETAPP INC at a value of $7,748,640,000'},\n",
              " {'text': 'D. E. Shaw & Co., Inc. owns 323440 shares of NETAPP INC at a value of $24,710,816,000'},\n",
              " {'text': 'EDMP, INC. owns 4698 shares of NETAPP INC at a value of $358,927,000'},\n",
              " {'text': 'NATIXIS ADVISORS, L.P. owns 40296 shares of NETAPP INC at a value of $3,079,000'},\n",
              " {'text': 'Smithfield Trust Co owns 215 shares of NETAPP INC at a value of $16,000'}]"
            ]
          },
          "metadata": {},
          "execution_count": 33
        }
      ]
    },
    {
      "cell_type": "code",
      "source": [
        "results = kg.query(cypher, params={\n",
        "    'chunkIdParam': ref_chunk_id\n",
        "})\n",
        "print(textwrap.fill(results[1]['text'], 60))"
      ],
      "metadata": {
        "colab": {
          "base_uri": "https://localhost:8080/"
        },
        "id": "S11SSGGGDS25",
        "outputId": "0b0d8e22-02f5-42c0-a789-dc6e14eafadf"
      },
      "execution_count": 35,
      "outputs": [
        {
          "output_type": "stream",
          "name": "stdout",
          "text": [
            "SHELTON CAPITAL MANAGEMENT owns 39124 shares of NETAPP INC\n",
            "at a value of $2,989,085,000\n"
          ]
        }
      ]
    }
  ]
}